In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#make 2 series
ser1 = Series([0,1,2],index = ['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [3]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [4]:
#add 2 series together
ser1+ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [5]:
#series 1 didn't have a value at index D, so sum of 'D' is Null

In [7]:
#create a dataframe
#trick: 'AB' -> the letters are the column values
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [11]:
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','LA','SF'])
dframe2

     A  D  C
NYC  0  1  2
LA   3  4  5
SF   6  7  8

In [13]:
#add 2 dataframes together
dframe1+dframe2

       A   B   C   D
LA   5.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [14]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [15]:
dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   5.0  3.0  5.0  4.0
NYC  0.0  1.0  2.0  1.0
SF   6.0  NaN  8.0  7.0

In [16]:
#it fills the zeros for the dframe2 values
#it kept the orginal dframe1 values
#now we only have 1 null value: B for SF (because there is no B column in dframe2)

In [17]:
dframe2

     A  D  C
NYC  0  1  2
LA   3  4  5
SF   6  7  8

In [18]:
#create series 3 by calling index-0 row of dataframe 2
ser3 = dframe2.ix[0]

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [19]:
ser3

A    0
D    1
C    2
Name: NYC, dtype: int64

In [20]:
#row name becomes series name. column names become index of values

In [21]:
#subtract that row from every row of dframe2
dframe2-ser3

     A  D  C
NYC  0  0  0
LA   3  3  3
SF   6  6  6